KURSACH_2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          30;
        startFace       25400;
    }
    outlet
    {
        type            patch;
        nFaces          30;
        startFace       25430;
    }
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          500;
        startFace       25460;
    }
    cylinder_1
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          120;
        startFace       25960;
    }
    cylinder_2
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          120;
        startFace       26080;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          25800;
        startFace       26200;
    }
)

// ************************************************************************* //
