KURSACH_2/system/blockMeshDict
  /*--------------------------------*- C++ -*----------------------------------*\
      =========                 |
      \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
       \\    /   O peration     | Website:  https://openfoam.org
        \\  /    A nd           | Version:  11
         \\/     M anipulation  |
    \*---------------------------------------------------------------------------*/
    FoamFile
    {
        format      ascii;
        class       dictionary;
        object      blockMeshDict;
    }
    // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
    
    convertToMeters 0.01;
    
    vertices
    (
    (0 0 0.25) //0
(0 0 -0.25) //1
(15 0 0.25) //2
(15 0 -0.25) //3
(25 0 0.25) //4
(25 0 -0.25) //5
(50 0 0.25) //6
(50 0 -0.25) //7
(70 0 0.25) //8
(70 0 -0.25) //9
(70 5 0.25) //10
(70 5 -0.25) //11
(50 5 -0.25) //12
(50 5 0.25) //13
(25 10 -0.25) //14
(25 10 0.25) //15
(15 12 -0.25) //16
(15 12 0.25) //17
(0 15 -0.25) //18
(0 15 0.25) //19
(8.585786437626904 8.585786437626904 0.25) //20
(8.585786437626904 8.585786437626904 -0.25) //21
(11.414213562373096 8.585786437626904 0.25) //22
(11.414213562373096 8.585786437626904 -0.25) //23
(8.585786437626904 11.414213562373096 0.25) //24
(8.585786437626904 11.414213562373096 -0.25) //25
(11.414213562373096 11.414213562373096 0.25) //26
(11.414213562373096 11.414213562373096 -0.25) //27
(18.585786437626904 3.585786437626905 0.25) //28
(18.585786437626904 3.585786437626905 -0.25) //29
(21.414213562373096 3.585786437626905 0.25) //30
(21.414213562373096 3.585786437626905 -0.25) //31
(18.585786437626904 6.414213562373095 0.25) //32
(18.585786437626904 6.414213562373095 -0.25) //33
(21.414213562373096 6.414213562373095 0.25) //34
(21.414213562373096 6.414213562373095 -0.25) //35
    );
    
    blocks
    (
        // cylinder blocks
        hex (0 2 3 1 20 22 23 21) (30 1 30) simpleGrading (1 1 1)//bottom_1
        hex (2 4 5 3 28 30 31 29) (30 1 30) simpleGrading (1 1 1)//bottom_2
        
        hex (0 20 21 1 19 24 25 18) (30 1 30) simpleGrading (1 1 1)//left
        
        hex (22 2 3 23 26 17 16 27) (30 1 30) simpleGrading (1 1 1)//center_1
        hex (2 28 29 3 17 32 33 16) (30 1 30) simpleGrading (1 1 1)//center_2
        hex (30 4 5 31 34 15 14 35) (30 1 30) simpleGrading (1 1 1)//center_3

        hex (24 26 27 25 19 17 16 18) (30 1 30) simpleGrading (1 1 1)//top_1
        hex (32 34 35 33 17 15 14 16) (30 1 30) simpleGrading (1 1 1)//top_2
        
        hex (4 6 7 5 15 13 12 14) (100 1 30) simpleGrading (1 1 1)//right
        
        // right block
        hex (6 8 9 7 13 10 11 12) (90 1 30) simpleGrading (1 1 1)
    );
    edges
    (
        arc 21 23 (10 8 -0.25)
arc 20 22 (10 8 0.25)
arc 29 31 (20 3 -0.25)
arc 28 30 (20 3 0.25)

arc 25 27 (10 12 -0.25)
arc 24 26 (10 12 0.25)
arc 33 35 (20 7 -0.25)
arc 32 34 (20 7 0.25)
arc 21 25 (8 10 -0.25)
arc 20 24 (8 10 0.25)
arc 29 33 (18 5 -0.25)
arc 28 32 (18 5 0.25)
arc 23 27 (12 10 -0.25)
arc 22 26 (12 10 0.25)
arc 31 35 (22 5 -0.25)
arc 30 34 (22 5 0.25)
    );
    boundary
    (
        inlet
        {
            type patch;
            faces
            (
                (0 19 18 1)
            );
        }
        outlet
        {
            type patch;
            faces
            (
                (8 10 11 9)
            );
        }
        wall
        {
            type wall;
            faces
            (
                (19 17 16 18)
                (17 15 14 16)
                (15 13 12 14)
                (13 10 11 12)

                (0 2 3 1)
                (2 4 5 3)
                (4 6 7 5)
                (6 8 9 7)
            );
        }
        cylinder_1
        {
            type wall;
            faces
            (
                (20 22 23 21)
                (22 26 27 23)
                (24 26 27 25)
                (20 24 25 21)


            );
            
        }
        cylinder_2
        {
            type wall;
            faces
            (
                (28 30 31 29)
                (30 34 35 31)
                (32 34 35 33)
                (28 32 33 29)
            );
            
        }
        frontAndBack
        {
            type empty;
            faces
            (
            		(1 3 23 21)
                (23 3 16 27)
                (3 29 33 16)
                (3 5 31 29)
                (31 5 14 35)
                (5 7 12 14)
                (7 9 11 12)
                (33 35 16 14)
                (25 27 16 18)
                (1 21 25 18)


                (0 2 22 20)
                (22 2 17 26)
                (2 28 32 17)
                (2 4 30 28)
                (30 4 15 34)
                (4 6 13 15)
                (6 8 10 13)
                (32 34 15 17)
                (24 26 17 19)
                (0 20 24 19)
            );
        }
    );
